cask_args appdir: '/Applications'

tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'mongodb/brew'

## Core utilities
brew 'antigen'
brew "awscli"
brew 'coreutils'
brew 'dos2unix'
brew 'ffmpeg'
brew 'findutils'
brew 'git'
brew 'mas'
brew 'stow'
brew 'svn'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'vim'
brew 'z'

## Utilities
brew 'gh'
brew 'hugo'
brew 'nyancat'
brew 'youtube-dl'

## Applications
cask 'alfred'
cask 'appcleaner'
cask 'bartender'
cask 'calibre'
cask 'clipy'
cask 'dmenu-mac'
cask 'fliqlo'
cask 'fluor'
cask 'iterm2'
cask 'itsycal'
cask 'karabiner-elements'
cask 'keycastr'
cask 'obsidian'
cask 'rowanj-gitx'
cask 'transmission'
cask 'vlc'
cask 'zoom'

## Security
cask 'blockblock'
cask 'cryptomator'
cask 'do-not-disturb'
cask 'keybase'
cask 'knockknock'
cask 'lulu'
cask 'nordvpn'
cask 'oversight'
# cask 'protonvpn'
# cask 'veracrypt'

## Browsers
cask 'firefox'
cask 'tor-browser'
# cask 'chromium'
# cask 'firefox-developer-edition'
# cask 'google-chrome'

## Editors
cask 'intellij-idea-ce'
cask 'visual-studio-code'
# cask 'sublime-text'
# cask 'intellij-idea'
# mas 'Xcode', id: 497799835

## Programming languages
# brew 'elixir'
brew 'go'
brew 'jenv'
# brew 'kotlin'
brew 'openjdk'
brew 'n'
brew 'node'
brew 'pyenv'
brew 'python'
brew 'rbenv'
brew 'ruby'


## Developer tools
cask 'docker'
cask 'insomnia'
# cask 'postman'
# brew 'ansible'
# cask 'vagrant'
# cask 'virtualbox'

## Database tools
# cask 'beekeeper-studio'
# brew 'mongodb-community'
# cask 'pgadmin4'
# brew 'postgresql'
# cask 'postgres'
# brew 'sqlite'
# cask 'sqlitebrowser'

## QuickLook helpers
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlimagesize'
cask 'suspicious-package'
cask 'apparency'
cask 'qlvideo'

## Fonts
cask 'font-hack'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-league-gothic'
cask 'font-noto-sans'
cask 'font-noto-sans-cjk'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'

## Apps
mas 'Amphetamine', id: 937984704
mas 'Cursor Pro', id: 1447043133
mas "Day One", id: 1055511498
mas 'Magnet', id: 441258766
mas 'Unsplash Wallpapers', id: 1284863847

## Password management
brew 'pass'
mas '1Password', id: 443987910
mas 'Bitwarden', id: 1352778147
mas 'Enpass', id: 732710998
mas 'Obsidian Authenticator App', id: 1191757556

## Office suite
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541

## Media editing
# mas 'Final Cut Pro', id: 424389933
# mas 'Logic Pro X', id: 634148309

## Commmunication
cask 'discord'
mas 'Slack', id: 803453959
mas 'Telegram', id: 747648890
mas 'WhatsApp Desktop', id: 1147396723
