cask_args appdir: '/Applications'

tap 'homebrew/services'
tap 'caskroom/cask'
tap 'caskroom/fonts'

# Install packages
brew 'antigen'
brew 'bash'
brew 'coreutils'
brew 'ffmpeg'
brew 'findutils'
brew 'git'
brew 'mas'
brew 'stow'
brew 'thefuck'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'vim'
brew 'youtube-dl'
brew 'z'
brew 'zsh'

# Install apps
cask 'alfred'
cask 'appcleaner'
cask 'atext'
cask 'atom'
cask 'bartender'
cask 'calibre'
cask 'dash'
cask 'firefox'
cask 'fliqlo'
cask 'fluor'
cask 'flux'
cask 'franz'
cask 'google-chrome'
cask 'hammerspoon'
cask 'insomnia'
cask 'iterm2'
cask 'itsycal'
cask 'keepassx'
cask 'keybase'
cask 'keycastr'
cask 'macdown'
cask 'micro-snitch'
cask 'rowanj-gitx'
cask 'shiftit'
cask 'spotify'
cask 'sublime-text'
cask 'telegram'
cask 'transmission'
cask 'tunnelbear'
cask 'visual-studio-code'
cask 'vlc'

# Install QuickLook helpers
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'
cask 'quicklook-csv'

# Install fonts
cask 'font-hack'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-league-gothic'
cask 'font-noto-sans'
cask 'font-noto-sans-cjk'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install apps from Mac App Store
mas '1Password', id: 443987910
mas 'Airmail 3', id: 918858936
mas 'Amphetamine', id: 937984704
mas 'Bear', id: 1091189122
mas 'Fantastical 2', id: 975937182
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pocket', id: 568494494
mas 'Skitch', id: 425955336
mas 'Twitter', id: 409789998

# Optionals

# Programming languages
brew 'elixir'
cask 'java'
brew 'golang'
brew 'python'
brew 'ruby'
brew 'node'

# Tools
cask 'docker'
cask 'insomnia'
cask 'virtualbox'
brew 'yarn'

# Databases
cask 'pgadmin4'
cask 'postgres'
brew 'postgresql'
brew 'sqlite'
cask 'sqlitebrowser'

# Jetbrains
# cask 'appcode'
# cask 'clion'
# cask 'datagrip'
# cask 'gogland'
# cask 'intellij-idea'
# cask 'intellij-idea-ce'
# cask 'phpstorm'
# cask 'pycharm'
# cask 'pycharm-ce'
# cask 'rubymine'
# cask 'webstorm'

# Applications
# mas 'aText', id: 488566438 # install aText from Mac App Store to transfer license
# mas 'Final Cut Pro', 424389933
# mas 'Logic Pro X', 634148309
# mas 'Xcode', 497799835
