cask_args appdir: '/Applications'

tap 'homebrew/services'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'

# Install packages
brew 'antigen'
brew 'bash'
brew 'coreutils'
brew 'dos2unix'
brew 'ffmpeg'
brew 'findutils'
brew 'git'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'nyancat'
brew 'ruby'
brew 'stow'
brew 'thefuck'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'vim'
brew 'youtube-dl'
brew 'z'
brew 'zsh'

# Install apps
cask 'alfred'
cask 'appcleaner'
cask 'ammonite'
cask 'atext'
cask 'atom'
cask 'backuploupe'
cask 'bartender'
cask 'calibre'
cask 'dash'
cask 'docker'
cask 'dynalist'
cask 'firefox'
cask 'firefoxdeveloperedition'
cask 'fliqlo'
cask 'fluor'
cask 'flux'
cask 'google-chrome'
cask 'gpgtools'
cask 'hammerspoon'
cask 'handbrake'
cask 'intellij-idea'
cask 'iterm2'
cask 'itsycal'
cask 'keepassx'
cask 'keybase'
cask 'keycastr'
cask 'launchcontrol'
cask 'macdown'
cask 'micro-snitch'
cask 'nordvpn'
cask 'rowanj-gitx'
cask 'shiftit'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'

# Install QuickLook helpers
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'
cask 'quicklook-csv'

# Install fonts
cask 'font-hack'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-league-gothic'
cask 'font-noto-sans'
cask 'font-noto-sans-cjk'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install apps from Mac App Store
mas '1Password', id: 443987910
mas 'Airmail 3', id: 918858936
mas 'Amphetamine', id: 937984704
mas 'Coinverter – The Currency Converter', id: 926121450
mas 'Enpass', id: 732710998
mas 'Fantastical 2', id: 975937182
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pocket', id: 568494494
mas 'Skitch', id: 425955336
mas 'Telegram', id: 747648890
mas 'Tomato One - Free Focus Timer', id: 907364780
mas 'Trello', id: 1278508951
mas 'Twitter', id: 409789998
mas 'Unsplash Wallpapers', id: 1284863847
mas 'Vim Options', id: 916688914
mas 'WhatsApp Desktop', id: 1147396723

# Optionals

# Programming languages
# brew 'elixir'
# cask 'java'
# brew 'golang'
# brew 'python'

# Tools
# brew 'ansible'
# cask 'insomnia'
# cask 'vagrant'
# cask 'virtualbox'
# brew 'yarn'

# Database tools
# cask 'pgadmin4'
# cask 'postgres'
# brew 'postgresql'
# brew 'sqlite'
# cask 'sqlitebrowser'

# Applications
# mas 'aText', id: 488566438 # install aText from Mac App Store to transfer license
# mas 'Final Cut Pro', 424389933
# mas 'Logic Pro X', 634148309
# mas 'Xcode', 497799835
